---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityValue
source: html/79829f09-ad7a-548b-45b2-1412e597a8be.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyShadowsIntensityValue Property

"Shadows intensity"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyShadowsIntensityValue { get; }
```